2020-08-04 15:52:39.498594: I tensorflow/stream_executor/cuda/cuda_diagnostics.cc:305] kernel version seems to match DSO: 410.78.0
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to
==================================================================================================
input (InputLayer)              (None, 320, 320, 3)  0
__________________________________________________________________________________________________
block1_conv1 (Conv2D)           (None, 320, 320, 64) 1792        input[0][0]
__________________________________________________________________________________________________
block1_conv2 (Conv2D)           (None, 320, 320, 64) 36928       block1_conv1[0][0]
__________________________________________________________________________________________________
block1_conv2_bn (BatchNormaliza (None, 320, 320, 64) 256         block1_conv2[0][0]
__________________________________________________________________________________________________
activation_1 (Activation)       (None, 320, 320, 64) 0           block1_conv2_bn[0][0]
__________________________________________________________________________________________________
block1_pool (MaxPooling2D)      (None, 160, 160, 64) 0           activation_1[0][0]
__________________________________________________________________________________________________
block2_conv1 (Conv2D)           (None, 160, 160, 64) 36928       block1_pool[0][0]
__________________________________________________________________________________________________
block2_conv2 (Conv2D)           (None, 160, 160, 128 73856       block2_conv1[0][0]
__________________________________________________________________________________________________
block2_conv2_bn (BatchNormaliza (None, 160, 160, 128 512         block2_conv2[0][0]
__________________________________________________________________________________________________
activation_2 (Activation)       (None, 160, 160, 128 0           block2_conv2_bn[0][0]
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, 160, 160, 128 0           activation_2[0][0]
__________________________________________________________________________________________________
block2_pool (MaxPooling2D)      (None, 80, 80, 128)  0           dropout_1[0][0]
__________________________________________________________________________________________________
block3_conv1 (Conv2D)           (None, 80, 80, 128)  147584      block2_pool[0][0]
__________________________________________________________________________________________________
block3_conv2 (Conv2D)           (None, 80, 80, 256)  295168      block3_conv1[0][0]
__________________________________________________________________________________________________
block3_conv3 (Conv2D)           (None, 80, 80, 256)  590080      block3_conv2[0][0]
__________________________________________________________________________________________________
block3_conv3_bn (BatchNormaliza (None, 80, 80, 256)  1024        block3_conv3[0][0]
__________________________________________________________________________________________________
activation_3 (Activation)       (None, 80, 80, 256)  0           block3_conv3_bn[0][0]
__________________________________________________________________________________________________
dropout_2 (Dropout)             (None, 80, 80, 256)  0           activation_3[0][0]
__________________________________________________________________________________________________
block3_pool (MaxPooling2D)      (None, 40, 40, 256)  0           dropout_2[0][0]
__________________________________________________________________________________________________
block4_conv1 (Conv2D)           (None, 40, 40, 256)  590080      block3_pool[0][0]
__________________________________________________________________________________________________
block4_conv2 (Conv2D)           (None, 40, 40, 512)  1180160     block4_conv1[0][0]
__________________________________________________________________________________________________
block4_conv3 (Conv2D)           (None, 40, 40, 512)  2359808     block4_conv2[0][0]
__________________________________________________________________________________________________
block4_conv3_bn (BatchNormaliza (None, 40, 40, 512)  2048        block4_conv3[0][0]
__________________________________________________________________________________________________
dropout_3 (Dropout)             (None, 40, 40, 512)  0           block4_conv3_bn[0][0]
__________________________________________________________________________________________________
activation_4 (Activation)       (None, 40, 40, 512)  0           dropout_3[0][0]
__________________________________________________________________________________________________
block4_pool (MaxPooling2D)      (None, 20, 20, 512)  0           activation_4[0][0]
__________________________________________________________________________________________________
block5_conv1 (Conv2D)           (None, 20, 20, 512)  2359808     block4_pool[0][0]
__________________________________________________________________________________________________
block5_conv2 (Conv2D)           (None, 20, 20, 512)  2359808     block5_conv1[0][0]
__________________________________________________________________________________________________
block5_conv3 (Conv2D)           (None, 20, 20, 512)  2359808     block5_conv2[0][0]
__________________________________________________________________________________________________
block5_conv3_bn (BatchNormaliza (None, 20, 20, 512)  2048        block5_conv3[0][0]
__________________________________________________________________________________________________
activation_5 (Activation)       (None, 20, 20, 512)  0           block5_conv3_bn[0][0]
__________________________________________________________________________________________________
depthwise_conv2d_1 (DepthwiseCo (None, 20, 20, 512)  4608        activation_5[0][0]
__________________________________________________________________________________________________
depthwise_conv2d_2 (DepthwiseCo (None, 20, 20, 512)  4608        activation_5[0][0]
__________________________________________________________________________________________________
depthwise_conv2d_3 (DepthwiseCo (None, 20, 20, 512)  4608        activation_5[0][0]
__________________________________________________________________________________________________
average_pooling2d_1 (AveragePoo (None, 1, 1, 512)    0           activation_5[0][0]
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (None, 20, 20, 512)  2048        depthwise_conv2d_1[0][0]
__________________________________________________________________________________________________
batch_normalization_4 (BatchNor (None, 20, 20, 512)  2048        depthwise_conv2d_2[0][0]
__________________________________________________________________________________________________
batch_normalization_6 (BatchNor (None, 20, 20, 512)  2048        depthwise_conv2d_3[0][0]
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 1, 1, 128)    65536       average_pooling2d_1[0][0]
__________________________________________________________________________________________________
activation_7 (Activation)       (None, 20, 20, 512)  0           batch_normalization_2[0][0]
__________________________________________________________________________________________________
activation_9 (Activation)       (None, 20, 20, 512)  0           batch_normalization_4[0][0]
__________________________________________________________________________________________________
activation_11 (Activation)      (None, 20, 20, 512)  0           batch_normalization_6[0][0]
__________________________________________________________________________________________________
batch_normalization_8 (BatchNor (None, 1, 1, 128)    512         conv2d_5[0][0]
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 20, 20, 128)  65536       activation_5[0][0]
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 20, 20, 128)  65536       activation_7[0][0]
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 20, 20, 128)  65536       activation_9[0][0]
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 20, 20, 128)  65536       activation_11[0][0]
__________________________________________________________________________________________________
activation_13 (Activation)      (None, 1, 1, 128)    0           batch_normalization_8[0][0]
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, 20, 20, 128)  512         conv2d_1[0][0]
__________________________________________________________________________________________________
batch_normalization_3 (BatchNor (None, 20, 20, 128)  512         conv2d_2[0][0]
__________________________________________________________________________________________________
batch_normalization_5 (BatchNor (None, 20, 20, 128)  512         conv2d_3[0][0]
__________________________________________________________________________________________________
batch_normalization_7 (BatchNor (None, 20, 20, 128)  512         conv2d_4[0][0]
__________________________________________________________________________________________________
bilinear_upsampling_1 (Bilinear (None, 20, 20, 128)  0           activation_13[0][0]
__________________________________________________________________________________________________
activation_6 (Activation)       (None, 20, 20, 128)  0           batch_normalization_1[0][0]
__________________________________________________________________________________________________
activation_8 (Activation)       (None, 20, 20, 128)  0           batch_normalization_3[0][0]
__________________________________________________________________________________________________
activation_10 (Activation)      (None, 20, 20, 128)  0           batch_normalization_5[0][0]
__________________________________________________________________________________________________
activation_12 (Activation)      (None, 20, 20, 128)  0           batch_normalization_7[0][0]
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 20, 20, 640)  0           bilinear_upsampling_1[0][0]
                                                                 activation_6[0][0]
                                                                 activation_8[0][0]
                                                                 activation_10[0][0]
                                                                 activation_12[0][0]
__________________________________________________________________________________________________
dropout_4 (Dropout)             (None, 20, 20, 640)  0           concatenate_1[0][0]
__________________________________________________________________________________________________
aspp_conv1 (Conv2D)             (None, 20, 20, 512)  328192      dropout_4[0][0]
__________________________________________________________________________________________________
sub_pixel_1 (SubpixelConv2D)    (None, 40, 40, 128)  0           aspp_conv1[0][0]
__________________________________________________________________________________________________
concatenate_2 (Concatenate)     (None, 40, 40, 640)  0           activation_4[0][0]
                                                                 sub_pixel_1[0][0]
__________________________________________________________________________________________________
X_up_1 (Conv2D)                 (None, 40, 40, 512)  328192      concatenate_2[0][0]
__________________________________________________________________________________________________
sub_pixel_2 (SubpixelConv2D)    (None, 80, 80, 128)  0           X_up_1[0][0]
__________________________________________________________________________________________________
concatenate_3 (Concatenate)     (None, 80, 80, 384)  0           dropout_2[0][0]
                                                                 sub_pixel_2[0][0]
__________________________________________________________________________________________________
X_up_2 (Conv2D)                 (None, 80, 80, 128)  49280       concatenate_3[0][0]
__________________________________________________________________________________________________
sub_pixel_3 (SubpixelConv2D)    (None, 160, 160, 32) 0           X_up_2[0][0]
__________________________________________________________________________________________________
concatenate_4 (Concatenate)     (None, 160, 160, 160 0           dropout_1[0][0]
                                                                 sub_pixel_3[0][0]
__________________________________________________________________________________________________
X_up_3 (Conv2D)                 (None, 160, 160, 128 20608       concatenate_4[0][0]
__________________________________________________________________________________________________
sub_pixel_4 (SubpixelConv2D)    (None, 320, 320, 32) 0           X_up_3[0][0]
__________________________________________________________________________________________________
concatenate_5 (Concatenate)     (None, 320, 320, 96) 0           activation_1[0][0]
                                                                 sub_pixel_4[0][0]
__________________________________________________________________________________________________
conv2d_8 (Conv2D)               (None, 160, 160, 1)  161         concatenate_4[0][0]
__________________________________________________________________________________________________
conv2d_7 (Conv2D)               (None, 80, 80, 1)    385         concatenate_3[0][0]
__________________________________________________________________________________________________
conv2d_6 (Conv2D)               (None, 40, 40, 1)    641         concatenate_2[0][0]
__________________________________________________________________________________________________
new1_e_chanel_1_1 (Conv2D)      (None, 320, 320, 2)  1730        concatenate_5[0][0]
__________________________________________________________________________________________________
new1_e_chanel_10 (Conv2D)       (None, 320, 320, 2)  1730        concatenate_5[0][0]
__________________________________________________________________________________________________
new1_e_chanel_11 (Conv2D)       (None, 320, 320, 2)  1730        concatenate_5[0][0]
__________________________________________________________________________________________________
new1_e_chanel0_1 (Conv2D)       (None, 320, 320, 2)  1730        concatenate_5[0][0]
__________________________________________________________________________________________________
new1_e_chanel01 (Conv2D)        (None, 320, 320, 2)  1730        concatenate_5[0][0]
__________________________________________________________________________________________________
new1_e_chanel1_1 (Conv2D)       (None, 320, 320, 2)  1730        concatenate_5[0][0]
__________________________________________________________________________________________________
new1_e_chanel10 (Conv2D)        (None, 320, 320, 2)  1730        concatenate_5[0][0]
__________________________________________________________________________________________________
new1_e_chanel11 (Conv2D)        (None, 320, 320, 2)  1730        concatenate_5[0][0]
__________________________________________________________________________________________________
conv2d_transpose_3 (Conv2DTrans (None, 320, 320, 1)  16          conv2d_8[0][0]
__________________________________________________________________________________________________
conv2d_transpose_2 (Conv2DTrans (None, 320, 320, 1)  64          conv2d_7[0][0]
__________________________________________________________________________________________________
conv2d_transpose_1 (Conv2DTrans (None, 320, 320, 1)  256         conv2d_6[0][0]
__________________________________________________________________________________________________
concatenate_6 (Concatenate)     (None, 320, 320, 19) 0           conv2d_transpose_3[0][0]
                                                                 conv2d_transpose_2[0][0]
                                                                 conv2d_transpose_1[0][0]
                                                                 new1_e_chanel_1_1[0][0]
                                                                 new1_e_chanel_10[0][0]
                                                                 new1_e_chanel_11[0][0]
                                                                 new1_e_chanel0_1[0][0]
                                                                 new1_e_chanel01[0][0]
                                                                 new1_e_chanel1_1[0][0]
                                                                 new1_e_chanel10[0][0]
                                                                 new1_e_chanel11[0][0]
__________________________________________________________________________________________________
conv2d_9 (Conv2D)               (None, 320, 320, 1)  19          concatenate_6[0][0]
__________________________________________________________________________________________________
new_e_chanel_1_1 (Activation)   (None, 320, 320, 2)  0           new1_e_chanel_1_1[0][0]
__________________________________________________________________________________________________
new_e_chanel_10 (Activation)    (None, 320, 320, 2)  0           new1_e_chanel_10[0][0]
__________________________________________________________________________________________________
new_e_chanel_11 (Activation)    (None, 320, 320, 2)  0           new1_e_chanel_11[0][0]
__________________________________________________________________________________________________
new_e_chanel0_1 (Activation)    (None, 320, 320, 2)  0           new1_e_chanel0_1[0][0]
__________________________________________________________________________________________________
new_e_chanel01 (Activation)     (None, 320, 320, 2)  0           new1_e_chanel01[0][0]
__________________________________________________________________________________________________
new_e_chanel1_1 (Activation)    (None, 320, 320, 2)  0           new1_e_chanel1_1[0][0]
__________________________________________________________________________________________________
new_e_chanel10 (Activation)     (None, 320, 320, 2)  0           new1_e_chanel10[0][0]
__________________________________________________________________________________________________
new_e_chanel11 (Activation)     (None, 320, 320, 2)  0           new1_e_chanel11[0][0]
__________________________________________________________________________________________________
fuse (Activation)               (None, 320, 320, 1)  0           conv2d_9[0][0]
__________________________________________________________________________________________________
o2 (Activation)                 (None, 320, 320, 1)  0           conv2d_transpose_3[0][0]
__________________________________________________________________________________________________
o3 (Activation)                 (None, 320, 320, 1)  0           conv2d_transpose_2[0][0]
__________________________________________________________________________________________________
o4 (Activation)                 (None, 320, 320, 1)  0           conv2d_transpose_1[0][0]
==================================================================================================
Total params: 13,489,558
Trainable params: 13,482,262
Non-trainable params: 7,296
